const loveList = [
  'Ти - моя веселка після дощу життя.',
  'З тобою кожен момент наповнений смислом.',
  'Твоя посмішка - моє найяскравіше світло в темному світі.',
  'Любов до тебе - моє щоденне натхнення вірш.',
  'Ти - моє щастя і гармонія.',
  'З тобою кожен день стає особливою пригодою.',
  'Твої очі - мої зірки в безмежному небі.',
  'Твоя ніжність лікує мою душу.',
  'Ти - моя душевна половина.',
  'Твоя любов робить мене сильнішим.',
  "З тобою я знаходжу смисл в кожному слові 'любов'.",
  'Ти - моя надія в трудні моменти.',
  'Твої поцілунки - найкращий спосіб відчути казку.',
  'Твоя рука - моє безпечне пристановище.',
  "З любов'ю до тебе кожен день наповнений чудесами.",
  'Ти - моя зірка керування в бурхливому житті.',
  'Любов до тебе, наче мелодія у моєму серці.',
  'Ти - моя мрія, яка здійснилася.',
  'Твої обійми - моє улюблене місце.',
  'Ти - моє знання життя, моя вічна любов.',
  'Твої слова - ніжні ноти в мелодії мого серця.',
  'З тобою навіть звичайність перетворюється на чудо.',
  'Ти - натхнення моїх найкрасивіших моментів.',
  'Твоя любов - як чарівний ліхтар у темному лісі життя.',
  'Твої обійми - це дім, де я знаходжу спокій і тепло.',
  'Твій сміх - мелодія, яка робить мою душу співати.',
  'Ти - самий цінний розділ в моїй книзі щастя.',
  'З тобою навіть сірі дні наповнюються кольорами весняної радуги.',
  'Твої очі - карти, які ведуть мене до скарбів твоєї душі.',
  "Ти - моя неповторна казка, написана з любов'ю.",
  'Твої поцілунки - солодкий наліт весняного вітру на моїх губах.',
  "З любов'ю до тебе кожен день - як чарівна подорож.",
  'Ти - зірка, навколо якої обертається моя всесвіт.',
  'Твоя посмішка - ключ до замку мого щастя.',
  'Твої руки - міст до безмежного океану наших почуттів.',
  'Ти - мій маяк в морі труднощів і сумнівів.',
  'З тобою навіть звичайність перетворюється на диво.',
  'Твоя любов - світло в моєму житті.',
  'Ти - мій свято в сірому будньому.',
  'З тобою кожен день - як чарівна подорож.',
  'Твої очі - дві блискучі зірки на моєму небесному склепі.',
  'Ти - моя муза, яка надихає мій творчий шлях.',
  'Твоя посмішка - феєрверк у моєму серці.',
  'З тобою навіть мить стає вічністю.',
  'Ти - мій ангел, що впав з небес у моє життя.',
  'Твої поцілунки - як магія, що пробуджує мою душу.',
  'Ти - мій захід сонця в океані твоєї ніжності.',
  'Твої руки - моє порятунок у світі суєти.',
  'Ти - зірка, яка освітлює мій шлях в темряві.',
  'Твоя любов - як дощ, оживляючий мою висохлу душу.',
  'З тобою кожен момент - як частина чарівного пазла.',
  'Твої очі - вікно в безмежний світ нашої любові.',
  'Ти - моє найцінніше скарбниця в цьому житті.',
  "З любов'ю до тебе кожен день - свято моєї душі.",
]

const mainTitle = document.querySelector('.main-title')
const mainBtn = document.querySelector('.main-button')

const randomLoveWord = () => {
  const index = Math.floor(Math.random() * loveList.length)

  return loveList[index]
}

mainBtn.addEventListener('click', (e) => {
  return (mainTitle.textContent = randomLoveWord())
})
